codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl020.h
/*-------------------------------------------------------------------------
 * PIC32MM0032GPL020 processor header
 * Build date : May 01 2015
 *
 * Copyright (c) 2015, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#pragma once
#ifndef __32MM0032GPL020_H
#define __32MM0032GPL020_H

#if defined (__LANGUAGE_C__) || defined (__LANGUAGE_C_PLUS_PLUS)

#ifdef __cplusplus
extern "C" {
#endif

extern volatile unsigned int        RTCCON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :4;
    unsigned OUTSEL:3;
    unsigned RTCOE:1;
    unsigned :3;
    unsigned WRLOCK:1;
    unsigned :3;
    unsigned ON:1;
    unsigned ALMRPT:8;
    unsigned AMASK:4;
    unsigned :2;
    unsigned CHIME:1;
    unsigned ALRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __RTCCON1bits_t;
extern volatile __RTCCON1bits_t RTCCON1bits __asm__ ("RTCCON1") __attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CLKSEL:2;
    unsigned :9;
    unsigned FDIV:5;
    unsigned DIV:16;
  };
  struct {
    unsigned w:32;
  };
} __RTCCON2bits_t;
extern volatile __RTCCON2bits_t RTCCON2bits __asm__ ("RTCCON2") __attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        RTCCON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        RTCSTAT __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned HALFSEC:1;
    unsigned ALMSYNC:1;
    unsigned SYNC:1;
    unsigned :2;
    unsigned ALMEVT:1;
  };
  struct {
    unsigned w:32;
  };
} __RTCSTATbits_t;
extern volatile __RTCSTATbits_t RTCSTATbits __asm__ ("RTCSTAT") __attribute__((section("sfrs")));
extern volatile unsigned int        RTCSTATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        RTCSTATSET __attribute__((section("sfrs")));
extern volatile unsigned int        RTCSTATINV __attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIME __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned SECONE:4;
    unsigned SECTEN:3;
    unsigned :1;
    unsigned MINONE:4;
    unsigned MINTEN:3;
    unsigned :1;
    unsigned HRONE:4;
    unsigned HRTEN:3;
  };
  struct {
    unsigned w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIMECLR __attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIMESET __attribute__((section("sfrs")));
extern volatile unsigned int        RTCTIMEINV __attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATE __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned WDAY:3;
    unsigned :5;
    unsigned DAYONE:4;
    unsigned DAYTEN:2;
    unsigned :2;
    unsigned MTHONE:4;
    unsigned MTHTEN:1;
    unsigned :3;
    unsigned YRONE:4;
    unsigned YRTEN:4;
  };
  struct {
    unsigned w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATECLR __attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATESET __attribute__((section("sfrs")));
extern volatile unsigned int        RTCDATEINV __attribute__((section("sfrs")));
extern volatile unsigned int        ALMTIME __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned SECONE:4;
    unsigned SECTEN:3;
    unsigned :1;
    unsigned MINONE:4;
    unsigned MINTEN:3;
    unsigned :1;
    unsigned HRONE:4;
    unsigned HRTEN:3;
  };
  struct {
    unsigned w:32;
  };
} __ALMTIMEbits_t;
extern volatile __ALMTIMEbits_t ALMTIMEbits __asm__ ("ALMTIME") __attribute__((section("sfrs")));
extern volatile unsigned int        ALMTIMECLR __attribute__((section("sfrs")));
extern volatile unsigned int        ALMTIMESET __attribute__((section("sfrs")));
extern volatile unsigned int        ALMTIMEINV __attribute__((section("sfrs")));
extern volatile unsigned int        ALMDATE __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned WDAY:3;
    unsigned :5;
    unsigned DAYONE:4;
    unsigned DAYTEN:2;
    unsigned :2;
    unsigned MTHONE:4;
    unsigned MTHTEN:1;
    unsigned :3;
    unsigned YRONE:4;
    unsigned YRTEN:4;
  };
  struct {
    unsigned w:32;
  };
} __ALMDATEbits_t;
extern volatile __ALMDATEbits_t ALMDATEbits __asm__ ("ALMDATE") __attribute__((section("sfrs")));
extern volatile unsigned int        ALMDATECLR __attribute__((section("sfrs")));
extern volatile unsigned int        ALMDATESET __attribute__((section("sfrs")));
extern volatile unsigned int        ALMDATEINV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned MOD:4;
    unsigned CCSEL:1;
    unsigned T32:1;
    unsigned TMRPS:2;
    unsigned CLKSEL:3;
    unsigned TMRSYNC:1;
    unsigned CCPSLP:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned SYNC:5;
    unsigned ALTSYNC:1;
    unsigned ONESHOT:1;
    unsigned TRIGEN:1;
    unsigned OPS:4;
    unsigned :2;
    unsigned RTRGEN:1;
    unsigned OPSSRC:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP1CON1bits_t;
extern volatile __CCP1CON1bits_t CCP1CON1bits __asm__ ("CCP1CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        CCP1CON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ASDG:8;
    unsigned :4;
    unsigned SSDG:1;
    unsigned :1;
    unsigned ASDGM:1;
    unsigned PWMRSEN:1;
    unsigned ICS:3;
    unsigned AUXOUT:2;
    unsigned :1;
    unsigned ICGSM:2;
    unsigned OCAEN:1;
    unsigned OCBEN:1;
    unsigned OCCEN:1;
    unsigned OCDEN:1;
    unsigned OCEEN:1;
    unsigned OCFEN:1;
    unsigned :1;
    unsigned OENSYNC:1;
  };
  struct {
    unsigned w:32;
  };
} __CCP1CON2bits_t;
