codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl020.h
#define _NVMDATA1_NVMDATA1_POSITION              0x00000000
#define _NVMDATA1_NVMDATA1_MASK                  0xFFFFFFFF
#define _NVMDATA1_NVMDATA1_LENGTH                0x00000020

#define _NVMSRCADDR_NVMSRCADDR_POSITION          0x00000000
#define _NVMSRCADDR_NVMSRCADDR_MASK              0xFFFFFFFF
#define _NVMSRCADDR_NVMSRCADDR_LENGTH            0x00000020

#define _NVMPWP_PWP_POSITION                     0x00000000
#define _NVMPWP_PWP_MASK                         0x00FFFFFF
#define _NVMPWP_PWP_LENGTH                       0x00000018

#define _NVMPWP_PWPULOCK_POSITION                0x0000001F
#define _NVMPWP_PWPULOCK_MASK                    0x80000000
#define _NVMPWP_PWPULOCK_LENGTH                  0x00000001

#define _NVMBWP_BWP0_POSITION                    0x00000008
#define _NVMBWP_BWP0_MASK                        0x00000100
#define _NVMBWP_BWP0_LENGTH                      0x00000001

#define _NVMBWP_BWP1_POSITION                    0x00000009
#define _NVMBWP_BWP1_MASK                        0x00000200
#define _NVMBWP_BWP1_LENGTH                      0x00000001

#define _NVMBWP_BWP2_POSITION                    0x0000000A
#define _NVMBWP_BWP2_MASK                        0x00000400
#define _NVMBWP_BWP2_LENGTH                      0x00000001

#define _NVMBWP_BWPULOCK_POSITION                0x0000000F
#define _NVMBWP_BWPULOCK_MASK                    0x00008000
#define _NVMBWP_BWPULOCK_LENGTH                  0x00000001

#define _RPCON_IOLOCK_POSITION                   0x0000000B
#define _RPCON_IOLOCK_MASK                       0x00000800
#define _RPCON_IOLOCK_LENGTH                     0x00000001

#define _RPINR1_INT4R_POSITION                   0x00000000
#define _RPINR1_INT4R_MASK                       0x0000001F
#define _RPINR1_INT4R_LENGTH                     0x00000005

#define _RPINR2_ICM1R_POSITION                   0x00000010
#define _RPINR2_ICM1R_MASK                       0x001F0000
#define _RPINR2_ICM1R_LENGTH                     0x00000005

#define _RPINR2_ICM2R_POSITION                   0x00000018
#define _RPINR2_ICM2R_MASK                       0x1F000000
#define _RPINR2_ICM2R_LENGTH                     0x00000005

#define _RPINR3_ICM3R_POSITION                   0x00000000
#define _RPINR3_ICM3R_MASK                       0x0000001F
#define _RPINR3_ICM3R_LENGTH                     0x00000005

#define _RPINR5_OCFAR_POSITION                   0x00000010
#define _RPINR5_OCFAR_MASK                       0x001F0000
#define _RPINR5_OCFAR_LENGTH                     0x00000005

#define _RPINR5_OCFBR_POSITION                   0x00000018
#define _RPINR5_OCFBR_MASK                       0x1F000000
#define _RPINR5_OCFBR_LENGTH                     0x00000005

#define _RPINR6_TCKIAR_POSITION                  0x00000000
#define _RPINR6_TCKIAR_MASK                      0x0000001F
#define _RPINR6_TCKIAR_LENGTH                    0x00000005

#define _RPINR6_TCKIBR_POSITION                  0x00000008
#define _RPINR6_TCKIBR_MASK                      0x00001F00
#define _RPINR6_TCKIBR_LENGTH                    0x00000005

#define _RPINR9_U2RXR_POSITION                   0x00000010
#define _RPINR9_U2RXR_MASK                       0x001F0000
#define _RPINR9_U2RXR_LENGTH                     0x00000005

#define _RPINR9_U2CTSR_POSITION                  0x00000018
#define _RPINR9_U2CTSR_MASK                      0x1F000000
#define _RPINR9_U2CTSR_LENGTH                    0x00000005

#define _RPINR11_SDI2R_POSITION                  0x00000000
#define _RPINR11_SDI2R_MASK                      0x0000001F
#define _RPINR11_SDI2R_LENGTH                    0x00000005

#define _RPINR11_SCK2INR_POSITION                0x00000008
#define _RPINR11_SCK2INR_MASK                    0x00001F00
#define _RPINR11_SCK2INR_LENGTH                  0x00000005

#define _RPINR11_SS2INR_POSITION                 0x00000010
#define _RPINR11_SS2INR_MASK                     0x001F0000
#define _RPINR11_SS2INR_LENGTH                   0x00000005

#define _RPINR12_CLCINAR_POSITION                0x00000010
#define _RPINR12_CLCINAR_MASK                    0x001F0000
#define _RPINR12_CLCINAR_LENGTH                  0x00000005

#define _RPINR12_CLCINBR_POSITION                0x00000018
#define _RPINR12_CLCINBR_MASK                    0x1F000000
#define _RPINR12_CLCINBR_LENGTH                  0x00000005

#define _RPOR0_RP1R_POSITION                     0x00000000
#define _RPOR0_RP1R_MASK                         0x0000000F
#define _RPOR0_RP1R_LENGTH                       0x00000004

#define _RPOR0_RP2R_POSITION                     0x00000008
#define _RPOR0_RP2R_MASK                         0x00000F00
#define _RPOR0_RP2R_LENGTH                       0x00000004

#define _RPOR0_RP3R_POSITION                     0x00000010
#define _RPOR0_RP3R_MASK                         0x000F0000
#define _RPOR0_RP3R_LENGTH                       0x00000004

#define _RPOR0_RP4R_POSITION                     0x00000018
#define _RPOR0_RP4R_MASK                         0x0F000000
#define _RPOR0_RP4R_LENGTH                       0x00000004

#define _RPOR1_RP5R_POSITION                     0x00000000
#define _RPOR1_RP5R_MASK                         0x0000000F
#define _RPOR1_RP5R_LENGTH                       0x00000004

#define _RPOR1_RP6R_POSITION                     0x00000008
#define _RPOR1_RP6R_MASK                         0x00000F00
#define _RPOR1_RP6R_LENGTH                       0x00000004

#define _RPOR1_RP7R_POSITION                     0x00000010
#define _RPOR1_RP7R_MASK                         0x000F0000
#define _RPOR1_RP7R_LENGTH                       0x00000004

#define _RPOR1_RP8R_POSITION                     0x00000018
#define _RPOR1_RP8R_MASK                         0x0F000000
#define _RPOR1_RP8R_LENGTH                       0x00000004

#define _RPOR2_RP9R_POSITION                     0x00000000
#define _RPOR2_RP9R_MASK                         0x0000000F
#define _RPOR2_RP9R_LENGTH                       0x00000004

#define _RPOR2_RP10R_POSITION                    0x00000008
#define _RPOR2_RP10R_MASK                        0x00000F00
#define _RPOR2_RP10R_LENGTH                      0x00000004

#define _RPOR2_RP11R_POSITION                    0x00000010
#define _RPOR2_RP11R_MASK                        0x000F0000
#define _RPOR2_RP11R_LENGTH                      0x00000004

#define _RPOR2_RP12R_POSITION                    0x00000018
#define _RPOR2_RP12R_MASK                        0x0F000000
#define _RPOR2_RP12R_LENGTH                      0x00000004

